{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "input_dim": 12425, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 4}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPowQzovVXNlcnMvcm9vdDAxL1B5Y2hhcm1Qcm9qZWN0cy80\neXAvZW1iZWRkaW5nLnB52gg8bGFtYmRhPmoAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [100], "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 12425, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}